[
    {
        "id":"01",
        "judul":"Doa Memohon Pertolongan",
        "arab":"رَبَّنَا أَعِنَّا وَلَا تُعِنْ عَلَيْنَا، وَانْصُرْنَا وَلَا تَنْصُرْ عَلَيْنَا، وَامْكُرْ لَنَا وَلَا تَمْكُرْ عَلَيْنَا، وَاهْدِنَا وَيَسِّرْ هُدَاى إِلَيْنَا، وَانْصُرْنَا عَلَى مَنْ بَغَى عَلَيْنَا",
        "arti":"Wahai Rabb kami, bantulah kami (dalam menghadapi musuh) dan Janganlah Engkau bantu mereka dalam menghadapi kami. Tolonglah kami (dalam menghadapi mereka) dan Janganlah Engkau tolong mereka dalam menghadapi kami. Tunjukkan kami jalan untuk mengusir musuh dan Janganlah Engkau tunjukkan mereka jalan untuk mempertahankan diri. Berilah kami petunjuk dan mudahkanlah kami untuk mengikuti petunjuk itu. Tolonglah kami atas orang-orang yang telah menzhalimi kami.",
        "dalil":"(HR. Abu Dawud no. 1510, At Tirmidzi no. 3551, Ibnu Majah no. 3830)",
    },
    {
        "id":"02",
        "judul":"Ketika bertemu Musuh",
        "arab":"رَبَّنَآ اَفْرِغْ عَلَيْنَا صَبْرًا وَّثَبِّتْ اَقْدَامَنَا وَانْصُرْنَا عَلَى الْقَوْمِ الْكٰفِرِيْنَ",
        "arti":"Wahai Rabb kami, Limpahkanlah kesabaran kepada kami, dan Kokohkanlah langkah kami, dan Tolonglah kami menghadapi orang-orang kafir.",
        "dalil":"(QS. Al-Baqarah: 250)",
    },
    {
        "id":"03",
        "judul":"Ketika diteror Musuh",
        "arab":"حَسْبُنَا اللّٰهُ وَنِعْمَ الْوَكِيْلُ",
        "arti":"Cukuplah Allah (menjadi penolong) bagi kami dan Dia sebaik-baik pelindung.",
        "dalil":"(QS. Ali Imran: 173)",
    },
    {
        "id":"04",
        "judul":"Ketika diperdaya Musuh"
        "arab":"وَاُفَوِّضُ اَمْرِيْٓ اِلَى اللّٰهِ ۗاِنَّ اللّٰهَ بَصِيْرٌ ۢبِالْعِبَادِ",
        "arti":"Dan aku menyerahkan urusanku kepada Allah. Sungguh, Allah Maha Melihat terhadap hamba-hamba-Nya.",
        "dalil":"(QS. Ghafir: 44)",
    },
    {
        "id":"05",
        "judul":"Ketika menjadi Buronan musuh untuk di Bunuh",
        "arab":" رَبِّ نَجِّنِيْ مِنَ الْقَوْمِ الظّٰلِمِيْنَ",
        "arti":"Ya Rabbku, selamatkanlah aku dari orang-orang yang zhalim itu.",
        "dalil":"(QS. Al-Qashash: 21)",
    },
    {
        "id":"06",
        "judul":"Ketika menuju suatu jalan atau bila Jalan menjadi Samar",
        "arab":"عَسٰى رَبِّيْٓ اَنْ يَّهْدِيَنِيْ سَوَاۤءَ السَّبِيْلِ",
        "arti":"Mudah-mudahan Tuhanku memimpin aku ke jalan yang benar.",
        "dalil":"(QS. Al-Qashash: 22)",
    },
    {
        "id":"07",
        "judul":"Ketika jumlah Musuh banyak dan Mujahidin sedikit serta Pertolongan tak kunjung datang",
        "arab":"كَمْ مِّنْ فِئَةٍ قَلِيْلَةٍ غَلَبَتْ فِئَةً كَثِيْرَةً ۢبِاِذْنِ اللّٰهِ ۗ وَاللّٰهُ مَعَ الصّٰبِرِيْنَ",
        "arti":"Betapa banyak kelompok kecil mengalahkan kelompok besar dengan izin Allah. Dan Allah beserta orang-orang yang sabar",
        "dalil":"(QS. Al-Baqarah: 249)",
    },
    {
        "id":"08",
        "judul":"Ketika melihat sekelompok orang Kafir",
        "arab":"وَلَمَّا رَاَ الْمُؤْمِنُوْنَ الْاَحْزَابَ قَالُوْا هٰذَا مَا وَعَدَنَا اللّٰهُ وَرَسُوْلُهٗ وَصَدَقَ اللّٰهُ وَرَسُوْلُهٗ ۖوَمَا زَادَهُمْ اِلَّآ اِيْمَانًا وَّتَسْلِيْمًا",
        "arti":"Dan ketika orang-orang mukmin melihat golongan-golongan (yang bersekutu) itu, mereka berkata, “Inilah yang dijanjikan Allah dan Rasul-Nya kepada kita.” Dan benarlah Allah dan Rasul-Nya. Dan yang demikian itu menambah keimanan dan keislaman mereka.",
        "dalil":"(QS. Al-Ahzab: 22)",
    },
    {
        "id":"09",
        "judul":"Semboyan kaum Muslimin terhadap orang-orang Kafir yang mengatur siasat di Malam hari",
        "arab":"‏‏‏‏‏‏عَنْ الْمُهَلَّبِ بْنِ أَبِي صُفْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَخْبَرَنِي مَن سَمِعَ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ:‏‏‏‏ إِنْ بُيِّتُّمْ فَلْيَكُنْ شِعَارُكُمْ حم لَا يُنْصَرُونَ",
        "arti":"Dari Al Muhallab bin Abi Shufrah, dari orang yang mendengar bahwa Nabi SAW bersabda “Jika musuh mengatur siasat untuk (menyerang) kalian di Malam hari. Maka ucapkanlah, ”Haa Miim, mereka tidak diberi pertolongan”.”",
        "dalil":"(HR. Abu Dawud no. 2597, At Tirmidzi no. 1682)",
    },
    {
        "id":"10",
        "judul":"Bila orang-orang Kafir menguasai sebuah Negeri dan Kaum Muslimin di Dalamnya dalam keadaan Lemah",
        "arab":"عَلَى اللّٰهِ تَوَكَّلْنَا ۚرَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ الظّٰلِمِيْنَ. وَنَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكٰفِرِيْنَ",
        "arti":"Kepada Allah-lah kami bertawakal. Ya Tuhan kami, janganlah Engkau jadikan kami (sasaran) fitnah bagi kaum yang zhalim. Dan selamatkanlah kami dengan rahmat-Mu dari orang-orang kafir.",
        "dalil":"(QS. Yunus: 85-86)",
    },
    {
        "id":"11",
        "judul":"Ketika Perang berkecamuk",
        "arab":"اَللَّهُمَّ أَنْتَ عَضُدُنَا، وَأَنْتَ نَصِيْرُنَا، بِكَ نَحُوْلُ وَبِكَ نَصُوْلُ وَبِكَ نُقَاتِلُ",
        "arti":"Ya Allah, Engkau adalah tempat bersandar kami. Engkau adalah penolong kami. Dengan (pertolongan-Mu) kami bergerak. Dengan (pertolongan-Mu) kami menyergap. Dan dengan (pertolongan-Mu) kami berperang.",
        "dalil":"(HR. At Tirmidzi no. 3584, Ibnu Hibban no. 4761)",
    },
    {
        "id":"12",
        "judul":"Bila jumlah Kaum Muslimin Banyak",
        "arab":"اَللَّهُمَّ بِكَ أُقَاتِلُ، بِكَ أُحَاوِلُ، وَبِكَ أُصَاوِلُ، وَﻻَ حَوْلَ وَﻻَ قُوَّةَ إِﻻَّ بِاللهِ",
        "arti":"Ya Allah, Dengan (pertolongan-Mu) aku berperang, Dengan (pertolongan-Mu) aku bergerak, Dengan (pertolongan-Mu) aku menyergap, serta Tiada daya dan kekuatan kecuali (dengan pertolongan) Allah.",
        "dalil":"(HR. At Tirmidzi no. 3340, Ad Darami no. 2441, Ibnu Hibban no. 1975, 2027, 4758)",
    },
    {
        "id":"13",
        "judul":"Ketika merasa Takut atau dekat dengan Kejahatan orang-orang Kafir",
        "arab":"ﻵ إِلَهَ إِﻻَّ اللهُ",
        "arti":"Tiada sesembahan yang berhak di sembah kecuali Allah",
        "dalil":"(HR. Muslim no. 2880, Bukhari no. 3168, 3403, 6650, 6716)",
    },
    {
        "id":"14",
        "judul":"Ketika merasa takut kepada suatu Kaum",
        "arab":"اللَّهُمَّ إِنَّا نَجْعَلُكَ فِي نُحُورِهِمْ، ‏‏‏‏‏‏وَنَعُوذُ بِكَ مِنْ شُرُورِهِمْ",
        "arti":"Ya Allah, Sesungguhnya kami menjadikan Engkau di leher mereka (untuk memerangi mereka). Dan aku berlindung kepada-Mu dari kejahatan mereka.",
        "dalil":"(HR. Abu Dawud no. 1537, Ibnu Hibban no. 4765, Ahmad no. 4/414)",
    },
    {
        "id":"15",
        "judul":"Ketika orang-orang Kafir mengepung Kaum Muslimin",
        "arab":"اللَّهُمَّ اكْفِنَاهُمْ بِمَا شِئْتَ",
        "arti":"Ya Allah, cukupkanlah kami dalam menghadapi mereka dengan apa yang Engkau kehendaki",
        "dalil":"(HR. Muslim no. 3005)",
    },
    {
        "id":"16",
        "judul":"Doa untuk kecelakaan orang-orang Kafir ketika mereka Menghancurkan kaum Muslimin atau Menyombongkan diri",
        "arab":"اللَّهُمَّ مُزِّقْهُمْ كُلَّ مُمَزَّقٍ",
        "arti":"Ya Allah, hancurkan mereka sehancur-hancurnya.",
        "dalil":"(HR. Bukhari no. 64, 2741, 4162, 6836)",
    },
    {
        "id":"17",
        "judul":"Ketika kaum Kafir menjadikan kaum Muslimin Lalai dari ketaatan kepada Allah",
        "arab":"مَلأَ اللهُ بُيُوْتَهُمْ وَقُبُوْرَهُمْ نَارًا",
        "arti":"Semoga Allah memenuhi rumah-rumah mereka dan kuburan-kuburan mereka dengan api.",
        "dalil":"(HR. Muslim no. 627, Bukhari no. 5917, 4169, 3802, 2714)",
    },
    {
        "id":"18",
        "judul":"Ketika memasuki daerah kaum Kafir dan Menginvasi Mereka",
        "arab":"اللهُ أَكْبَرُ، خَرَبَتْ خَيْبَرُ، إِنَّا إِذّا نَزَلْنَا بِسَاحَةِ قَوْمٍ فَسَاءَ صَبَاحُ الْمُنْذِرِيْنَ",
        "arti":"Allahu Akbar, Khaibar akan runtuh. Sungguh jika kami turun di medan untuk melawan suatu kaum maka buruklah pagi hari orang-orang yang kami peringati",
        "dalil":"(Fathul Bari, 3/288 no. 610)",
    },
    {
        "id":"19",
        "judul":"Doa untuk Kecelakaan orang yang mencela dan menyakiti kaum Muslimin",
        "arab":"اللَّهُمَّ عَلَيْكَ بِـ[الْكَافِرِيْنَ] (ثلاثا)، اللَّهُمَّ عَلَيْكَ بِـ[فُلَانٌ وَفُلَانٌ مِنْهُمْ يُسَمِّيْهِمْ]",
        "arti":"Ya Allah, hancurkanlah [orang-orang Kafir] (di ucapkan 3 kali). Ya Allah, hancurkanlah ... [menyebut nama mereka]",
        "dalil":"(HR Bukhari no. 237, 498, 2776, 3014, 3641)",
    },
    {
        "id":"20",
        "judul":"Ketika orang Kafir menganggap Mulia sesembahan dan Dunia mereka",
        "arab":"اللَّهُمَّ أَعْلَى وَ أَجَلُّ، اَللَّهُ مَوْلَانَا وَلَا مَوْلَى لَكُمْ",
        "arti":"Allah-lah yang Maha Tinggi dan Maha Agung. Allah-lah pelindung kami, sedangkan kalian tidak mempunyai pelindung",
        "dalil":"(HR. Bukhari no. 2784, 3817)",
    },
    {
        "id":"21",
        "judul":"Memohon mati Syahid kepada Allah dengan Jujur",
        "arab":"اللَّهُمَّ ارْزُقْنِيْ شَهَادَةً فِى سَبِيلِكَ",
        "arti":"Ya Allah, anugerahkan kepadaku mati syahid di jalan-Mu",
        "dalil":"(HR. Bukhari no. 1890)",
    },
    {
        "id":"22",
        "judul":"Memohon pertolongan kepada Allah saat bertemu Musuh",
        "arab":"اللَّهُمَّ آتِنَا مَا وَعَدْتَنَا، اللَّهُمَّ أَنْجِزْ لَنَا مَا وَعَدْتَنَا، اللَّهُمَّ إِنْ تَهْلِكْ هَذِهِ الْعِصَابَةُ مِنْ أَهْلِ الْإِسْلَامِ لَا تُعْبَدْ فِي الْأَرْضِ",
        "arti":"Ya Allah, berikanlah apa-apa yang telah Engkau janjikan kepada kami. Ya Allah, sempurnakanlah apa-apa yang telah Engkau janjikan kepada kami. Ya Allah, jika Engkau hancurkan tentara dari kaum Muslimin ini, tentu Engkau tidak akan disembah di muka bumi ini.",
        "dalil":"(HR. Muslim no. 1763, Ibnu Hibban no. 4793, Abu Awanah no. 4/220, 225)",
    },
    {
        "id":"23",
        "judul":"Ketika kaum Muslimin berhasil mengepung Kota dan menerobos pertahanan Musuh",
        "arab":"ﻵ إِلَهَ إِﻻَّ اللهُ وَاللهُ أَكْبَرُ",
        "arti":"Tiada sesembahan yang berhak di sembah kecuali Allah",
        "dalil":"(HR. Muslim no. 2920)",
    },
    {
        "id":"24",
        "judul":"Ketika sebagian kaum Muslimin menjadi Tawanan atau menghadapi Kesulitan",
        "arab":"",
        "arti":"",
        "dalil":"()",
    },
    {
        "id":"25",
        "judul":"Memuji Allah setelah datangnya Pertolongan",
        "arab":"",
        "arti":"",
        "dalil":"()",
    },
    {
        "id":"26",
        "judul":"Memuji Allah setelah selesai berperang",
        "arab":"",
        "arti":"",
        "dalil":"()",
    },
    {
        "id":"27",
        "judul":"Doa untuk orang yang tidak pandai mengendarai Kuda dan sejenisnya",
        "arab":"",
        "arti":"",
        "dalil":"()",
    },
    {
        "id":"28",
        "judul":"Wasiat seorang Imam kepada komandan Pasukan",
        "arab":"",
        "arti":"",
        "dalil":"()",
    },
    {
        "id":"29",
        "judul":"Senandung Mujahid",
        "arab":"",
        "arti":"",
        "dalil":"()",
    },
    {
        "id":"30",
        "judul":"Doa untuk orang yang sedang melakukan suatu serangan kepada Kaum Kafir",
        "arab":"",
        "arti":"",
        "dalil":"()",
    },
    {
        "id":"31",
        "judul":"Doa untuk suatu Kompi yang diberikan Kemenangan yang Baik",
        "arab":"",
        "arti":"",
        "dalil":"()",
    },
    {
        "id":"32",
        "judul":"Doa untuk orang yang keluar Berjihad di jalan Allah",
        "arab":"",
        "arti":"",
        "dalil":"()",
    },
]
